## Dataframe pandas

In [10]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from random import randint

In [3]:
m = np.arange(30).reshape(6,-1)
df = DataFrame(m, columns=list('abcde'))
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29

In [4]:
df.shape

(6, 5)

In [5]:
df['a']

0     0
1     5
2    10
3    15
4    20
5    25
Name: a, dtype: int32

In [6]:
df.loc[0]

a    0
b    1
c    2
d    3
e    4
Name: 0, dtype: int32

In [7]:
df['e'][5], df.loc[5]['e']

(29, 29)

In [8]:
df2 = df[['a','c','d']]
df2

    a   c   d
0   0   2   3
1   5   7   8
2  10  12  13
3  15  17  18
4  20  22  23
5  25  27  28

In [9]:
type(df2)

pandas.core.frame.DataFrame

In [11]:
d = {letra:[randint(1,30) for _ in range(5)] for letra in "ABCDE"}
df3 = DataFrame(d)
df3

    A   B   C   D   E
0  13  28  27   4  13
1  11  14  11  25  23
2  14   6  12   1  25
3  26  21   6   8   3
4  15  10   7  19  19

### Carga de ficheros, funciones t√≠picas.

In [12]:
df = pd.read_csv("pandas_ficheros/Pedidos.txt", delimiter=";")
df.head()

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil
3     10251   VICTE           3          1    41.34    Francia
4     10252   SUPRD           4          2    51.30    Belgica

In [13]:
df.tail(3)

     idpedido cliente  idempleado  idempresa  importe            pais
827     11075   RICSU           8          2     6.19           Suiza
828     11076   BONAP           4          2    38.28         Francia
829     11077   RATTC           1          2     8.53  Estados Unidos

In [14]:
df.shape

(830, 6)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   idpedido    830 non-null    int64
 1   cliente     830 non-null    object
 2   idempleado  830 non-null    int64
 3   idempresa   830 non-null    int64
 4   importe     830 non-null    float64
 5   pais        830 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 39.0+ KB

In [16]:
df.describe()

           idpedido  idempleado   idempresa      importe
count    830.000000  830.000000  830.000000   830.000000
mean   10662.500000    4.403614    2.008434    78.244205
std      239.744656    2.499648    0.778899   116.779294
min    10248.000000    1.000000    1.000000     0.020000
25%    10455.250000    2.000000    1.000000    13.380000
50%    10662.500000    4.000000    2.000000    41.360000
75%    10869.750000    7.000000    3.000000    91.430000
max    11077.000000    9.000000    3.000000  1007.640000

In [22]:
paises = df.pais.value_counts()
paises

pais
Estados Unidos    123
Alemania          122
Brasil             83
Francia            76
Reino Unido        55
Venezuela          46
Austria            40
Suecia             38
Canada             30
Mexico             28
Italia             28
Espanya            23
Finlandia          23
Irlanda            19
Belgica            19
Suiza              18
Dinamarca          18
Argentina          16
Portugal           13
Polonia             6
Noruega             6
Name: count, dtype: int64

In [23]:
len(paises)

21

In [24]:
# Quitar repetidos a una columna:
paises = df.pais.unique()
paises

array(['Finlandia', 'Alemania', 'Brasil', 'Francia', 'Belgica', 'Suiza',
       'Venezuela', 'Austria', 'Mexico', 'Estados Unidos', 'Suecia',
       'Italia', 'Espanya', 'Reino Unido', 'Irlanda', 'Portugal',
       'Canada', 'Dinamarca', 'Polonia', 'Noruega', 'Argentina'],
      dtype=object)

In [25]:
# Filtrar datos:
df[df.pais=='Noruega']

     idpedido cliente  idempleado  idempresa  importe     pais
139     10387   SANTG           1          2    93.63  Noruega
272     10520   SANTG           7          1    13.37  Noruega
391     10639   SANTG           7          3    38.64  Noruega
583     10831   SANTG           3          2    72.19  Noruega
661     10909   SANTG           1          2    53.05  Noruega
767     11015   SANTG           2          2     4.62  Noruega

In [26]:
df[(df.pais=='Noruega') & (df.importe > 50.0)]

     idpedido cliente  idempleado  idempresa  importe     pais
139     10387   SANTG           1          2    93.63  Noruega
583     10831   SANTG           3          2    72.19  Noruega
661     10909   SANTG           1          2    53.05  Noruega

In [28]:
df[df.pais=='Noruega'].to_csv("ficheros/noruega.csv", index=False, sep=';', decimal=',')

In [29]:
df.head()

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil
3     10251   VICTE           3          1    41.34    Francia
4     10252   SUPRD           4          2    51.30    Belgica

In [30]:
df['porc_iva'] = .21
df['iva'] = round(df.importe * df.porc_iva, 2)
df['total'] = round(df.importe + df.iva, 2)

In [31]:
df.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,porc_iva,iva,total
0,10248,WILMK,5,3,32.38,Finlandia,0.21,6.80,39.18
1,10249,TOMSP,6,1,11.61,Alemania,0.21,2.44,14.05
2,10250,HANAR,4,2,65.83,Brasil,0.21,13.82,79.65
3,10251,VICTE,3,1,41.34,Francia,0.21,8.68,50.02
4,10252,SUPRD,4,2,51.30,Belgica,0.21,10.77,62.07

In [32]:
auxdf = df[['idpedido','cliente','importe','porc_iva','iva','total','pais']]
auxdf.head(3)

   idpedido cliente  importe  porc_iva    iva  total       pais
0     10248   WILMK    32.38      0.21   6.80  39.18  Finlandia
1     10249   TOMSP    11.61      0.21   2.44  14.05   Alemania
2     10250   HANAR    65.83      0.21  13.82  79.65     Brasil

In [33]:
auxdf.to_excel("ficheros/pedidos.xlsx", index=False)

In [35]:
np.sum(df)

idpedido                                                8849875
cliente       WILMKTOMSPHANARVICTESUPRDHANARCHOPSRICSUWELLIH...
idempleado                                                 3655
idempresa                                                  1667
importe                                                64942.69
pais          FinlandiaAlemaniaBrasilFranciaBelgicaBrasilSui...
porc_iva                                                  174.3
iva                                                    13637.95
total                                                  78580.64
dtype: object